In [14]:
import numpy as np
import pandas as pd

In [10]:
num = 10 + 10
num

20

In [11]:
first_nump = np.array([29, 54, 478, 232, 12, 45, 90])
first_nump

array([ 29,  54, 478, 232,  12,  45,  90])

##### creating dataframes

In [12]:
first_df = pd.DataFrame({
    "name" : ["Stan Lee", "Cosmin Pollar", "Marek Gibzic", "Anton Zebi", "Inkara Merila"],
    "nationality" : ["American", "Czech", "Slovak", "American", "Honduran"],
    "gender" : ["Male", "Male", "Male", "Male", "Female"],
    "age" : [83, 25, 30, 21, 33]
})
first_df

            name nationality  gender  age
0       Stan Lee    American    Male   83
1  Cosmin Pollar       Czech    Male   25
2   Marek Gibzic      Slovak    Male   30
3     Anton Zebi    American    Male   21
4  Inkara Merila    Honduran  Female   33

In [15]:
print(
    first_df.shape, 
    first_df.info()
)
first_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         5 non-null      object
 1   nationality  5 non-null      object
 2   gender       5 non-null      object
 3   age          5 non-null      int64
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes
(5, 4) None

             age
count   5.000000
mean   38.400000
std    25.353501
min    21.000000
25%    25.000000
50%    30.000000
75%    33.000000
max    83.000000

##### reading from an exixsting file

In [21]:
new_file = pd.read_csv("fileInpOut/ecorp data.csv")
print(new_file.shape)
new_file.head()

(10050, 3)

                 name    sales      date
0    Sebastian Waite    607193  1/1/2020
1     Lizzie Haggins   1171366  1/1/2020
2       Ima Gaudreau    941504  1/1/2020
3  Leticia Michelsen    721826  1/1/2020
4   Stanley Margolin    904494  1/1/2020

##### Accessing Series

In [33]:
print(f"""
    {first_df["name"]},
    \n
    {first_df["age"]},
    \n
    {first_df["age"].mean()},
    \n
    {first_df["age"].std()},
    \n
    {first_df["nationality"].unique()},
    \n
    {first_df["nationality"].value_counts()},
    \n
    {first_df["nationality"].mode()} 
""")
first_df

    0         Stan Lee
1    Cosmin Pollar
2     Marek Gibzic
3       Anton Zebi
4    Inkara Merila
Name: name, dtype: object,


    0    83
1    25
2    30
3    21
4    33
Name: age, dtype: int64,


    38.4,


    25.353500744473138,


    ['American' 'Czech' 'Slovak' 'Honduran'],


    American    2
Czech       1
Slovak      1
Honduran    1
Name: nationality, dtype: int64,


    0    American
dtype: object

            name nationality  gender  age
0       Stan Lee    American    Male   83
1  Cosmin Pollar       Czech    Male   25
2   Marek Gibzic      Slovak    Male   30
3     Anton Zebi    American    Male   21
4  Inkara Merila    Honduran  Female   33

##### accessing multiple column lists

In [34]:
first_df[["name", "nationality"]]

            name nationality
0       Stan Lee    American
1  Cosmin Pollar       Czech
2   Marek Gibzic      Slovak
3     Anton Zebi    American
4  Inkara Merila    Honduran

In [35]:
first_df[first_df["age"] == 33]

            name nationality  gender  age
4  Inkara Merila    Honduran  Female   33

In [39]:
first_df[(first_df["age"] == 33) & (first_df["gender"] == "Female")]

            name nationality  gender  age
4  Inkara Merila    Honduran  Female   33

In [38]:
first_df[(first_df["age"] == 83) | (first_df["gender"] == "Male")]

            name nationality gender  age
0       Stan Lee    American   Male   83
1  Cosmin Pollar       Czech   Male   25
2   Marek Gibzic      Slovak   Male   30
3     Anton Zebi    American   Male   21

In [45]:
first_df[(first_df["age"] % 2 == 0)]

           name nationality gender  age
2  Marek Gibzic      Slovak   Male   30